InformationRegisters/ИсторияЗаказаПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗаказаПокупателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияЗаказаПокупателя/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьВИсторию(Заказ, Дата, Пользователь, Комментарий) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияЗаказаПокупателя.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.Пользователь = Пользователь;	
	МенеджерЗаписи.Комментарий 	= Комментарий;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
